# https://github.com/Homebrew/homebrew-bundle

tap "stripe/stripe-cli"
tap "teamookla/speedtest"
tap "charmbracelet/tap"     # Charm tools (gum, etc.)
tap "openstatushq/cli"      # OpenStatus monitoring
tap "speakeasy-api/tap"     # API development tools
tap "sst/tap"               # Serverless Stack
tap "supabase/tap"          # Supabase CLI
tap "typesense/tap"         # Typesense search engine

# Homebrew
# https://github.com/Homebrew/brew/

# Shells
brew "bash"                 # Bourne Again SHell
brew "fish"                 # User-friendly shell
brew "zsh"                  # Z shell

# Editors
brew "helix"                # Modal text editor
brew "neovim"               # Text editor

# Build & Compilation
brew "cmake"                # Build system
brew "ninja"                # Build system
brew "pkgconf"              # Package config tool

# Languages & Runtimes
brew "elixir"               # Functional programming language
brew "php"                  # PHP language
brew "pipx"                 # Python app installer
brew "ruby", link: true     # Ruby language

# Git & Version Control
brew "fnm"                  # Fast Node version manager
brew "git"                  # Version control
brew "git-lfs"              # Large file storage for Git
brew "lazygit"              # Git TUI
brew "tig"                  # Git TUI

# Search & Navigation
brew "fd"                   # Simple find replacement
brew "fzf"                  # Fuzzy finder
brew "ripgrep"              # Fast grep replacement

# File Management & Utils
brew "eza"                  # Modern ls replacement
brew "magic-wormhole"       # Secure file transfer
brew "trash"                # Trash CLI
brew "tree"                 # Directory tree viewer
brew "yazi"                 # Terminal file manager
brew "zoxide"               # Smarter cd

# Productivity & Development
brew "bat"                  # Cat clone with syntax highlighting
brew "biome"                # Fast linter/formatter for JS/TS

brew "coreutils"            # GNU core utilities
brew "curl"                 # Data transfer tool
brew "direnv"               # Environment switcher
brew "fastfetch"            # System info fetcher
brew "glow"                 # Markdown viewer
brew "gum"                  # Beautiful shell scripts
brew "httpie"               # User-friendly HTTP client
brew "jq"                   # JSON processor
brew "jnv"                  # Interactive JSON viewer
brew "fx"                   # JSON viewer
brew "mise"                 # Polyglot tool version manager
brew "openssl"              # Cryptography library
brew "shellcheck"           # Shell script linter
brew "starship"             # Shell prompt

brew "zx"                   # JavaScript shell scripts

# Terminal Multiplexers
brew "tmux"                 # Terminal multiplexer
brew "zellij"               # Terminal workspace

# Media & Images
brew "ffmpeg"               # Multimedia processing
brew "imagemagick"          # Image manipulation

# Databases
brew "postgresql"           # PostgreSQL database
brew "redis"                # In-memory data store

# Containers & Deployment
brew "docker"               # Container platform
brew "lazydocker"           # Docker TUI
brew "flyctl"               # Fly.io deployment

# Cloud & APIs
brew "awscli"               # AWS CLI
brew "cloudflare-wrangler"   # Cloudflare Workers CLI
brew "gh"                   # GitHub CLI
brew "supabase"             # Supabase CLI

# Charm Tools
brew "charmbracelet/tap/crush"     # Image compression
brew "charmbracelet/tap/mods"      # AI chat in terminal
brew "charmbracelet/tap/pop"       # Email client
brew "charmbracelet/tap/skate"     # Personal key-value store
brew "charmbracelet/tap/soft-serve" # Git server
brew "charmbracelet/tap/vhs"       # Terminal recorder
brew "charmbracelet/tap/wishlist"  # SSH directory

# Lua
brew "luarocks"             # Lua package manager

# Downloaders
brew "lux"                  # Fast HTTP downloader
brew "wget"                 # HTTP downloader

# GUI & Desktop
brew "qt"                   # Cross-platform GUI toolkit

# Sync & Storage
brew "rclone"               # Cloud storage sync

# Code Analysis
brew "scc"                  # Code counter

# API & Testing
brew "scooter"              # API testing tool
brew "tlrc"                 # Official tldr client

# Search
brew "serpl"                # Search tool

# Archiving
brew "sevenzip"             # File archiver

# Dotfiles
brew "chezmoi"              # Dotfiles manager

# Data Viewers
brew "tabiew"               # CSV/TSV viewer
brew "speakeasy-api/tap/speakeasy" # API development
brew "sst/tap/opencode"            # Serverless framework
brew "supabase/tap/supabase"       # Supabase CLI
brew "typesense/tap/typesense-server"     # Search engine
brew "stripe"                   # Stripe CLI
brew "speedtest"                # Speedtest CLI

# homebrew-cask
# https://github.com/Homebrew/homebrew-cask

cask "font-geist-mono-nerd-font"   # Coding font
cask "font-symbols-only-nerd-font" # Icon font
cask "ngrok"                       # Local tunnel
cask "openstatus"                  # Status page
cask "google-chrome"               # Web browser
cask "cursor"                      # AI code editor
cask "zed"                         # High-performance editor
cask "figma"                       # Design tool
cask "discord"                     # Chat/communication
cask "notion"                      # Note taking
cask "notion-calendar"             # Notion calendar
cask "raycast"                     # Launcher/hotkey manager
cask "google-drive"                # Cloud storage
cask "linear-linear"                      # Issue tracking
cask "amazon-q"                    # AWS AI assistant
cask "slack"                       # Team communication
cask "whatsapp"                    # Messaging
cask "gcloud-cli"     # GCP tools

# Go tools
go "golang.org/x/tools/gopls"      # Go language server
go "honnef.co/go/tools/cmd/staticcheck"  # Go linter
